Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ32MC104.h
/* IC1CON */
#define _ICM IC1CONbits.ICM
#define _ICBNE IC1CONbits.ICBNE
#define _ICOV IC1CONbits.ICOV
#define _ICI IC1CONbits.ICI
#define _ICTMR IC1CONbits.ICTMR
#define _ICSIDL IC1CONbits.ICSIDL
#define _ICM0 IC1CONbits.ICM0
#define _ICM1 IC1CONbits.ICM1
#define _ICM2 IC1CONbits.ICM2
#define _ICI0 IC1CONbits.ICI0
#define _ICI1 IC1CONbits.ICI1

/* IC2CON */
/* Bitname _ICM cannot be defined because it is used by more than one SFR */
/* Bitname _ICBNE cannot be defined because it is used by more than one SFR */
/* Bitname _ICOV cannot be defined because it is used by more than one SFR */
/* Bitname _ICI cannot be defined because it is used by more than one SFR */
/* Bitname _ICTMR cannot be defined because it is used by more than one SFR */
/* Bitname _ICSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _ICM0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICM1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICM2 cannot be defined because it is used by more than one SFR */
/* Bitname _ICI0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICI1 cannot be defined because it is used by more than one SFR */

/* IC3CON */
/* Bitname _ICM cannot be defined because it is used by more than one SFR */
/* Bitname _ICBNE cannot be defined because it is used by more than one SFR */
/* Bitname _ICOV cannot be defined because it is used by more than one SFR */
/* Bitname _ICI cannot be defined because it is used by more than one SFR */
/* Bitname _ICTMR cannot be defined because it is used by more than one SFR */
/* Bitname _ICSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _ICM0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICM1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICM2 cannot be defined because it is used by more than one SFR */
/* Bitname _ICI0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICI1 cannot be defined because it is used by more than one SFR */

/* OC1CON */
#define _OCM OC1CONbits.OCM
#define _OCTSEL OC1CONbits.OCTSEL
#define _OCFLT OC1CONbits.OCFLT
#define _OCSIDL OC1CONbits.OCSIDL
#define _OCM0 OC1CONbits.OCM0
#define _OCM1 OC1CONbits.OCM1
#define _OCM2 OC1CONbits.OCM2

/* OC2CON */
/* Bitname _OCM cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLT cannot be defined because it is used by more than one SFR */
/* Bitname _OCSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _OCM0 cannot be defined because it is used by more than one SFR */
/* Bitname _OCM1 cannot be defined because it is used by more than one SFR */
/* Bitname _OCM2 cannot be defined because it is used by more than one SFR */

/* P1TCON */
#define _PTMOD P1TCONbits.PTMOD
#define _PTCKPS P1TCONbits.PTCKPS
#define _PTOPS P1TCONbits.PTOPS
#define _PTSIDL P1TCONbits.PTSIDL
#define _PTEN P1TCONbits.PTEN
#define _PTMOD0 P1TCONbits.PTMOD0
#define _PTMOD1 P1TCONbits.PTMOD1
#define _PTCKPS0 P1TCONbits.PTCKPS0
#define _PTCKPS1 P1TCONbits.PTCKPS1
#define _PTOPS0 P1TCONbits.PTOPS0
#define _PTOPS1 P1TCONbits.PTOPS1
#define _PTOPS2 P1TCONbits.PTOPS2
#define _PTOPS3 P1TCONbits.PTOPS3

/* P1TMR */
#define _PTMR P1TMRbits.PTMR
#define _PTDIR P1TMRbits.PTDIR

/* P1TPER */
#define _PTPER P1TPERbits.PTPER

/* P1SECMP */
#define _SEVTCMP P1SECMPbits.SEVTCMP
#define _SEVTDIR P1SECMPbits.SEVTDIR

/* PWM1CON1 */
#define _PEN1L PWM1CON1bits.PEN1L
#define _PEN2L PWM1CON1bits.PEN2L
#define _PEN3L PWM1CON1bits.PEN3L
#define _PEN1H PWM1CON1bits.PEN1H
#define _PEN2H PWM1CON1bits.PEN2H
#define _PEN3H PWM1CON1bits.PEN3H
#define _PMOD1 PWM1CON1bits.PMOD1
#define _PMOD2 PWM1CON1bits.PMOD2
#define _PMOD3 PWM1CON1bits.PMOD3

/* PWM1CON2 */
#define _UDIS PWM1CON2bits.UDIS
#define _OSYNC PWM1CON2bits.OSYNC
#define _IUE PWM1CON2bits.IUE
#define _SEVOPS PWM1CON2bits.SEVOPS
#define _SEVOPS0 PWM1CON2bits.SEVOPS0
#define _SEVOPS1 PWM1CON2bits.SEVOPS1
#define _SEVOPS2 PWM1CON2bits.SEVOPS2
#define _SEVOPS3 PWM1CON2bits.SEVOPS3

/* P1DTCON1 */
#define _DTA P1DTCON1bits.DTA
#define _DTAPS P1DTCON1bits.DTAPS
#define _DTB P1DTCON1bits.DTB
#define _DTBPS P1DTCON1bits.DTBPS
#define _DTA0 P1DTCON1bits.DTA0
#define _DTA1 P1DTCON1bits.DTA1
#define _DTA2 P1DTCON1bits.DTA2
#define _DTA3 P1DTCON1bits.DTA3
#define _DTA4 P1DTCON1bits.DTA4
#define _DTA5 P1DTCON1bits.DTA5
#define _DTAPS0 P1DTCON1bits.DTAPS0
#define _DTAPS1 P1DTCON1bits.DTAPS1
#define _DTB0 P1DTCON1bits.DTB0
#define _DTB1 P1DTCON1bits.DTB1
#define _DTB2 P1DTCON1bits.DTB2
#define _DTB3 P1DTCON1bits.DTB3
#define _DTB4 P1DTCON1bits.DTB4
#define _DTB5 P1DTCON1bits.DTB5
#define _DTBPS0 P1DTCON1bits.DTBPS0
#define _DTBPS1 P1DTCON1bits.DTBPS1

/* P1DTCON2 */
#define _DTS1I P1DTCON2bits.DTS1I
#define _DTS1A P1DTCON2bits.DTS1A
#define _DTS2I P1DTCON2bits.DTS2I
#define _DTS2A P1DTCON2bits.DTS2A
#define _DTS3I P1DTCON2bits.DTS3I
#define _DTS3A P1DTCON2bits.DTS3A

/* P1FLTACON */
#define _FAEN1 P1FLTACONbits.FAEN1
#define _FAEN2 P1FLTACONbits.FAEN2
#define _FAEN3 P1FLTACONbits.FAEN3
#define _FLTAM P1FLTACONbits.FLTAM
#define _FAOV1L P1FLTACONbits.FAOV1L
#define _FAOV1H P1FLTACONbits.FAOV1H
#define _FAOV2L P1FLTACONbits.FAOV2L
#define _FAOV2H P1FLTACONbits.FAOV2H
#define _FAOV3L P1FLTACONbits.FAOV3L
#define _FAOV3H P1FLTACONbits.FAOV3H

/* P1FLTBCON */
#define _FBEN1 P1FLTBCONbits.FBEN1
#define _FBEN2 P1FLTBCONbits.FBEN2
#define _FBEN3 P1FLTBCONbits.FBEN3
#define _FLTBM P1FLTBCONbits.FLTBM
#define _FBOV1L P1FLTBCONbits.FBOV1L
#define _FBOV1H P1FLTBCONbits.FBOV1H
#define _FBOV2L P1FLTBCONbits.FBOV2L
#define _FBOV2H P1FLTBCONbits.FBOV2H
#define _FBOV3L P1FLTBCONbits.FBOV3L
#define _FBOV3H P1FLTBCONbits.FBOV3H

/* P1OVDCON */
#define _POUT1L P1OVDCONbits.POUT1L
#define _POUT1H P1OVDCONbits.POUT1H
#define _POUT2L P1OVDCONbits.POUT2L
#define _POUT2H P1OVDCONbits.POUT2H
#define _POUT3L P1OVDCONbits.POUT3L
#define _POUT3H P1OVDCONbits.POUT3H
#define _POVD1L P1OVDCONbits.POVD1L
#define _POVD1H P1OVDCONbits.POVD1H
#define _POVD2L P1OVDCONbits.POVD2L
#define _POVD2H P1OVDCONbits.POVD2H
#define _POVD3L P1OVDCONbits.POVD3L
#define _POVD3H P1OVDCONbits.POVD3H

/* I2C1CON */
#define _SEN I2C1CONbits.SEN
#define _RSEN I2C1CONbits.RSEN
#define _PEN I2C1CONbits.PEN
#define _RCEN I2C1CONbits.RCEN
#define _ACKEN I2C1CONbits.ACKEN
#define _ACKDT I2C1CONbits.ACKDT
#define _STREN I2C1CONbits.STREN
#define _GCEN I2C1CONbits.GCEN
#define _SMEN I2C1CONbits.SMEN
#define _DISSLW I2C1CONbits.DISSLW
#define _A10M I2C1CONbits.A10M
#define _IPMIEN I2C1CONbits.IPMIEN
#define _SCLREL I2C1CONbits.SCLREL
#define _I2CSIDL I2C1CONbits.I2CSIDL
#define _I2CEN I2C1CONbits.I2CEN

/* I2C1STAT */
#define _TBF I2C1STATbits.TBF
#define _RBF I2C1STATbits.RBF
#define _R_W I2C1STATbits.R_W
#define _S I2C1STATbits.S
#define _P I2C1STATbits.P
#define _D_A I2C1STATbits.D_A
#define _I2COV I2C1STATbits.I2COV
#define _IWCOL I2C1STATbits.IWCOL
#define _ADD10 I2C1STATbits.ADD10
#define _GCSTAT I2C1STATbits.GCSTAT
#define _BCL I2C1STATbits.BCL
#define _TRSTAT I2C1STATbits.TRSTAT
#define _ACKSTAT I2C1STATbits.ACKSTAT

